NextFOAM-24/tutorials/basic/chtMultiRegionFoam/2DImplicitCyclic/system/rightFluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        preconditioner  DIC;
        smoother         GaussSeidel;
        agglomerator     assembledFaceAreaPair;
        maxIter         100;
        cacheAgglomeration  false;

    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
    }

    h
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        preconditioner  DIC;
        smoother         GaussSeidel;
        agglomerator     assembledFaceAreaPair;
        cacheAgglomeration  false;
    }

    hFinal
    {
        $h;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|k|epsilon|R)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    "(U|k|epsilon|R)Final"
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefPoint        (0.09 0 0);
    pRefValue       1e5;
}

relaxationFactors
{
    equations
    {
        ".*"           1;
    }
}

// ************************************************************************* //
